import os
from dotenv import load_dotenv

load_dotenv()
# Получаем токен из переменных окружения Railway
BOT_TOKEN = os.getenv('BOT_TOKEN')

# Если токена нет в переменных окружения, используем дефолтный (для теста)
if not BOT_TOKEN:
    BOT_TOKEN = "8382879989:AAHU0mO0ENz3m4zSFsslNaahkDXMKJIm_HM"  # Замени на настоящий токен для теста

# Настройки магазина
PREMIUM_PRICE = 299
DELIVERY_PRICE = 150
FREE_DELIVERY_THRESHOLD = 1500  # Бесплатная доставка от этой суммы

# Категории товаров
CATEGORIES = {
    'pizza': '🍕 Пицца',
    'burger': '🍔 Бургеры',
    'sushi': '🍣 Суши',
    'drink': '☕ Напитки',
    'dessert': '🍰 Десерты',
    'salad': '🥗 Салаты'
}